LeadJoy-HyperStrike/zephyr_sdk_glue/include/dt-bindings/clock/hpm5151-clocks.h
/*
 * Copyright (c) 2026 HPMicro
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM5151_CLOCKS_H
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM5151_CLOCKS_H

/*
 * Auto-generated from HPM5151 clock/sysctl headers in:
 * sdk_env_v1.12.0_hpm5100_er_2026.06.30/hpm_sdk/soc/HPM5100/HPM5151
 */
#define CLK_SRC_OSC24M  0
#define CLK_SRC_PLL0_CLK0  1
#define CLK_SRC_PLL0_CLK1  2
#define CLK_SRC_PLL1_CLK0  3
#define CLK_SRC_PLL1_CLK1  4
#define CLK_SRC_PLL1_CLK2  5
#define CLK_SRC_PLL2_CLK0  6
#define CLK_SRC_PLL2_CLK1  7
#define CLK_SRC_OSC32K  8
#define CLK_ADC_SRC_AHB0  16
#define CLK_ADC_SRC_ANA0  17
#define CLK_ADC_SRC_ANA1  17
#define CLK_ADC_SRC_ANA2  17
#define CLK_ADC_SRC_ANA3  17
#define CLK_ADC_SRC_ANAN  17
#define CLK_I2S_SRC_AUD0  32
#define CLK_I2S_SRC_AUD1  32
#define CLK_I2S_SRC_AUDN  32
#define CLK_I2S_SRC_AUDX  33
#define CLK_WDG_SRC_AHB0  48
#define CLK_WDG_SRC_OSC32K  49
#define CLK_PWDG_SRC_OSC24M  176
#define CLK_PWDG_SRC_OSC32K  177
#define CLK_SRC_INVALID  255

#define CLOCK_CPU0  2556
#define CLOCK_MCHTMR0  16973824
#define CLOCK_GPTMR0  17039361
#define CLOCK_GPTMR1  17104898
#define CLOCK_I2C0  17170435
#define CLOCK_I2C1  17235972
#define CLOCK_I2C2  17301509
#define CLOCK_SPI0  17367046
#define CLOCK_SPI1  17432583
#define CLOCK_SPI2  17498120
#define CLOCK_SPI3  17563657
#define CLOCK_UART0  17629194
#define CLOCK_UART1  17694731
#define CLOCK_UART2  17760268
#define CLOCK_UART3  17825805
#define CLOCK_CAN0  19136526
#define CLOCK_XPI0  19595279
#define CLOCK_EFC0  19660816
#define CLOCK_REF0  19857425
#define CLOCK_REF1  19922962
#define CLOCK_AHB  4294772222
#define CLOCK_WATCHDOG0  17957632
#define CLOCK_WATCHDOG1  18023169
#define CLOCK_PWDG  4294904576
#define CLOCK_LMM0  16910592
#define CLOCK_MBX0  18089216
#define CLOCK_ACMP0  18744576
#define CLOCK_ACMP1  18810113
#define CLOCK_OPA0  18875648
#define CLOCK_OPA1  18941185
#define CLOCK_OPA2  19006722
#define CLOCK_OPA3  19072259
#define CLOCK_MOT0  4294903040
#define CLOCK_GPIO  18154752
#define CLOCK_HDMA0  18220288
#define CLOCK_HDMA1  18285825
#define CLOCK_ROM  16844032
#define CLOCK_TSNS  17892608
#define CLOCK_USB0  19793152
#define CLOCK_PTPC  19203328
#define CLOCK_PWM0  19268864
#define CLOCK_PWM1  19334401
#define CLOCK_PWM2  19399938
#define CLOCK_PWM3  19465475
#define CLOCK_EMDS  19531008
#define CLOCK_DHC  19727616
#define CLOCK_PTMR  4294902784
#define CLOCK_PUART  4294902785
#define CLOCK_PGPIO  4294902786
#define CLOCK_ANA0  4294901779
#define CLOCK_ANA1  4294901780
#define CLOCK_ANA2  4294901781
#define CLOCK_ANA3  4294901782
#define CLOCK_ADC0  18481408
#define CLOCK_ADC1  18546945
#define CLOCK_ADC2  18612482
#define CLOCK_ADC3  18678019
#define CLOCK_AUD0  4294901783
#define CLOCK_AUD1  4294901784
#define CLOCK_I2S0  18350592
#define CLOCK_I2S1  18416129
#define CLK_OSC0CLK0  2099712
#define CLK_PLL0CLK0  2230785
#define CLK_PLL0CLK1  2296322
#define CLK_PLL1CLK0  2427395
#define CLK_PLL1CLK1  2492932
#define CLK_PLL1CLK2  2558469
#define CLK_PLL2CLK0  2689542
#define CLK_PLL2CLK1  2755079

/* Compatibility aliases used by common codepaths. */
#define CLOCK_HDMA CLOCK_HDMA0
#define CLOCK_ACMP CLOCK_ACMP0

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM5151_CLOCKS_H */
